Revit 2024 API
ParameterTypeId.BendingDetailTypeDiameterDimensionTypeId Property
 "Diameter Dimension Style"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId BendingDetailTypeDiameterDimensionTypeId { get; }
Visual Basic
Public Shared ReadOnly Property BendingDetailTypeDiameterDimensionTypeId As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ BendingDetailTypeDiameterDimensionTypeId {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace